benchmark-results/round-3-intel-full-atillery/dragonfly - 14.txt
32        Threads
6         Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets      3883802.30          ---          ---         0.38817         0.37500         0.48700         0.53500         0.68700         0.85500         1.41500         1.54300        33.02300        36.35100    257487.79 
Gets            0.00         0.00         0.00             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---         0.00 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals    3883802.30         0.00         0.00         0.38817         0.37500         0.48700         0.53500         0.68700         0.85500         1.41500         1.54300        33.02300        36.35100    257487.79 
32        Threads
6         Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       407408.93          ---          ---         0.35879         0.34300         0.47100         0.51900         0.65500         0.80700         1.17500         1.27100         1.65500         3.80700     27052.01 
Gets      4074044.44     22523.78   4051520.66         0.35856         0.34300         0.47100         0.51900         0.65500         0.80700         1.17500         1.27100         1.60700         5.59900    163575.80 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals    4481453.37     22523.78   4051520.66         0.35858         0.34300         0.47100         0.51900         0.65500         0.80700         1.17500         1.27100         1.61500         5.59900    190627.81 
32        Threads
6         Connections per thread
75000     Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       111923.01          ---          ---         0.15771         0.15900         0.18300         0.19900         0.35100         0.43100         0.54300         0.68700         0.95100         1.71100      7431.59 
Gets      1119082.42      6598.19   1112484.23         0.15691         0.15900         0.18300         0.19900         0.35100         0.42300         0.50300         0.56700         0.77500         1.05500     44940.47 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals    1231005.44      6598.19   1112484.23         0.15698         0.15900         0.18300         0.19900         0.35100         0.42300         0.51100         0.57500         0.78300         1.71100     52372.05 
32        Threads
6         Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       388083.59          ---          ---         0.38194         0.37500         0.48700         0.53500         0.67900         0.83900         1.10300         1.20700         1.58300         2.49500     25729.17 
Gets      3880793.22   3880793.22         0.00         0.38181         0.37500         0.48700         0.53500         0.67900         0.83900         1.10300         1.20700         1.57500         2.49500    238339.05 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals    4268876.81   3880793.22         0.00         0.38182         0.37500         0.48700         0.53500         0.67900         0.83900         1.10300         1.20700         1.57500         2.49500    264068.22 
32        Threads
6         Connections per thread
75000     Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       106237.31          ---          ---         0.16046         0.15900         0.19100         0.20700         0.35900         0.43100         0.52700         0.62300         0.87100         1.29500      7043.01 
Gets      1062232.88   1062232.88         0.00         0.16014         0.15900         0.19100         0.20700         0.35900         0.43100         0.53500         0.63100         0.86300         0.99100     65236.60 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals    1168470.20   1062232.88         0.00         0.16017         0.15900         0.19100         0.20700         0.35900         0.43100         0.53500         0.63100         0.86300         1.29500     72279.62